Revit 2027 API
Application.IsConcreteEnabled Property
 Checks whether or not the concrete discipline is enabled, and enable or disable it.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsConcreteEnabled { get; set; }
Public Property IsConcreteEnabled As Boolean
	Get
	Set
public:
property bool IsConcreteEnabled {
	bool get ();
	void set (bool value);
}
member IsConcreteEnabled : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace